
import {Link} from "react-router-dom";

// Створюємо функціональний компонент Menu
const Menu = () => {
    return (
        // Контейнер для меню
        <div>
            {/* Список пунктів меню */}
            <ul>
                {/* Пункт меню: веде на головну сторінку */}
                <li><Link to={'/'}>home</Link></li>
                {/* Пункт меню: веде на сторінку входу */}
                <li><Link to={'/login'}>login</Link></li>
                {/* Пункт меню: веде на сторінку ресурсів */}
                <li><Link to={'/auth/resources'}>resources</Link></li>
            </ul>
            
            {/* Горизонтальна лінія для відділення меню від іншого контенту */}
            <hr/>
        </div>
    );
};

// Експортуємо компонент, щоб можна було використати його в інших файлах
export default Menu;
